In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import tensorflow as tf

ModuleNotFoundError: No module named 'numpy'

In [3]:
print ("Hello World")

Hello World

In [8]:
df_users=pd.read_csv("C:/Users/abdel/ACL/archive/users.csv")
df_users.head()

   user_id user_gender         country age_group traveller_type   join_date
0        1      Female  United Kingdom     35-44           Solo  2024-09-29
1        2        Male  United Kingdom     25-34           Solo  2023-11-29
2        3      Female          Mexico     25-34         Family  2022-04-03
3        4        Male           India     35-44         Family  2023-12-02
4        5       Other           Japan     25-34           Solo  2021-12-18

In [9]:
df_reviews=pd.read_csv("C:/Users/abdel/ACL/archive/reviews.csv")
df_reviews.head()

,review_id,user_id,hotel_id,review_date,score_overall,score_cleanliness,score_comfort,score_facilities,score_location,score_staff,score_value_for_money,review_text
0,1,1600,1,2022-10-07,8.7,8.6,8.7,8.5,9.0,8.8,8.7,Practice reduce young our because machine. Rec...
1,2,432,4,2020-03-24,9.1,10.0,9.1,9.0,8.6,9.4,8.6,Test cover traditional black. Process tell Mr ...
2,3,186,18,2023-12-18,8.8,9.7,8.8,8.3,8.7,8.1,8.6,Friend million student social study yeah. Grow...
3,4,1403,19,2022-06-22,8.9,9.0,8.8,8.5,9.6,9.1,8.3,Huge girl already remain truth behind card. Ap...
4,5,1723,17,2022-07-02,9.1,8.9,9.5,9.3,8.3,9.4,8.9,Cover feeling call community serve television ...

In [5]:
df_hotels=pd.read_csv("C:/Users/abdel/ACL/archive/hotels.csv")
df_hotels.head()

,hotel_id,hotel_name,city,country,star_rating,lat,lon,cleanliness_base,comfort_base,facilities_base,location_base,staff_base,value_for_money_base
0,1,The Azure Tower,New York,United States,5,40.7580,-73.9855,9.1,8.8,8.9,9.5,8.6,8.0
1,2,The Royal Compass,London,United Kingdom,5,51.5072,-0.1276,9.0,9.2,8.8,9.4,9.0,7.9
2,3,L'Étoile Palace,Paris,France,5,48.8566,2.3522,8.8,9.4,8.7,9.6,9.3,8.1
3,4,Kyo-to Grand,Tokyo,Japan,5,35.6895,139.6917,9.6,9.0,9.3,8.5,9.5,8.2
4,5,The Golden Oasis,Dubai,United Arab Emirates,5,25.2769,55.2962,9.3,9.5,9.6,8.9,9.4,8.5

In [6]:
# Test NumPy
print("=== NumPy Test ===")
array = np.array([[1, 2, 3], [4, 5, 6]])
print("Array:\n", array)
print("Mean of all elements:", np.mean(array))
print("Sum of each column:", np.sum(array, axis=0))

# Test Pandas
print("\n=== Pandas Test ===")
data = {
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Age': [24, 27, 22],
    'Score': [85, 90, 88]
}
df = pd.DataFrame(data)
print(df)
print("\nAverage score:", df['Score'].mean())

# Test integration
print("\n=== Combined Example ===")
df['Normalized Score'] = (df['Score'] - np.min(df['Score'])) / (np.max(df['Score']) - np.min(df['Score']))
print(df)

=== NumPy Test ===
Array:
 [[1 2 3]
 [4 5 6]]
Mean of all elements: 3.5
Sum of each column: [5 7 9]

=== Pandas Test ===
      Name  Age  Score
0    Alice   24     85
1      Bob   27     90
2  Charlie   22     88

Average score: 87.66666666666667

=== Combined Example ===
      Name  Age  Score  Normalized Score
0    Alice   24     85               0.0
1      Bob   27     90               1.0
2  Charlie   22     88               0.6

In [10]:
df=pd.concat([df_users,df_reviews,df_hotels],axis=1)
df.head()

,user_id,user_gender,country,age_group,traveller_type,join_date,review_id,user_id,hotel_id,review_date,...,country,star_rating,lat,lon,cleanliness_base,comfort_base,facilities_base,location_base,staff_base,value_for_money_base
0,1.0,Female,United Kingdom,35-44,Solo,2024-09-29,1,1600,1,2022-10-07,...,United States,5.0,40.7580,-73.9855,9.1,8.8,8.9,9.5,8.6,8.0
1,2.0,Male,United Kingdom,25-34,Solo,2023-11-29,2,432,4,2020-03-24,...,United Kingdom,5.0,51.5072,-0.1276,9.0,9.2,8.8,9.4,9.0,7.9
2,3.0,Female,Mexico,25-34,Family,2022-04-03,3,186,18,2023-12-18,...,France,5.0,48.8566,2.3522,8.8,9.4,8.7,9.6,9.3,8.1
3,4.0,Male,India,35-44,Family,2023-12-02,4,1403,19,2022-06-22,...,Japan,5.0,35.6895,139.6917,9.6,9.0,9.3,8.5,9.5,8.2
4,5.0,Other,Japan,25-34,Solo,2021-12-18,5,1723,17,2022-07-02,...,United Arab Emirates,5.0,25.2769,55.2962,9.3,9.5,9.6,8.9,9.4,8.5

In [22]:
review_hotel_df=df_reviews.merge(df_hotels,on='hotel_id',how='left')
df=review_hotel_df.merge(df_users,on='user_id',how='left')

df.head()

df.isnull().sum()

review_id                0
user_id                  0
hotel_id                 0
review_date              0
score_overall            0
score_cleanliness        0
score_comfort            0
score_facilities         0
score_location           0
score_staff              0
score_value_for_money    0
review_text              0
hotel_name               0
city                     0
country_x                0
star_rating              0
lat                      0
lon                      0
cleanliness_base         0
comfort_base             0
facilities_base          0
location_base            0
staff_base               0
value_for_money_base     0
user_gender              0
country_y                0
age_group                0
traveller_type           0
join_date                0
dtype: int64